export const ROW_LENGTH = 5;

export const ROW_COUNT = 6;

export interface ICell {
  key?: string,
  state?: ICellState,
}

export type ICellState = 'correctLetter' | 'correctLetterAndPlace' | 'wrongLetter' | 'neutral';

// export const lettersArray = ['A','B','C','D','E','F','G','H','I','J','K','L','M','N','O','P','Q','R','S','T','U','V','W','X','Y','Z',
//   'a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z' ];

export const lettersArray = ['А', 'а', 'Б', 'б', 'В', 'в', 'Г', 'г', 'Д', 'д', 'Е', 'е', 'Ё', 'ё', 'Ж', 'ж', 'З', 'з'
  , 'И', 'и', 'Й', 'й', 'К', 'к', 'Л', 'л', 'М', 'м', 'Н', 'н', 'О', 'о', 'П', 'п', 'Р', 'р', 'С', 'с', 'Т', 'т', 'У',
  'у', 'Ф', 'ф', 'Х', 'х', 'Ц', 'ц', 'Ч', 'ч', 'Ш', 'ш', 'Щ', 'щ', 'Ъ', 'ъ', 'Ы', 'ы', 'Ь', 'ь', 'Э', 'э', 'Ю', 'ю',
  'Я', 'я']

export const wordsArray = ['гений', 'дурка', 'дырка', 'ересь', 'карта', 'мешок', 'банан', 'кумыс', 'форма', 'радио',
  'евнух', 'ежиха', 'едкий', 'жених', 'завуч', 'земля', 'кефир', 'лыжня', 'левак', 'набат', 'обман','пилот',
  'олимп', 'отзыв', 'озноб', 'пиано', 'поиск', 'полка', 'рубец', 'порез', 'салат', 'сталь', 'слеза', 'свита', 'совет',
  'укроп', 'усечь', 'учеба', 'уметь', 'уступ', 'ушлый', 'физик', 'фронт', 'фауна', 'хворь', 'хобот', 'химик', 'фокус', 'ферма',
  'центр', 'циник', 'цапля', 'целый', 'червь', 'число', 'чукчи', 'черта', 'чешки', 'чудак', 'шалаш', 'шахта', 'щетка',
  'элита', 'экран', 'этнос', 'эклер', 'эпоха', 'этика', 'юноша', 'якорь', 'явный', 'самса','холст','пачка','палец',
  'якобы', 'яркий', 'ямщик', 'юрист', 'юниор', 'юркий', 'пицца', 'бутер', 'шпиль', 'штиль', 'рамен','тыква','билет']
